from libraries import * 


def Info_tab():
    st.title("# Info Tab")
    st.markdown("## General App Information")
    st.write("Η συγκεκριμένη εφαρμογή χρησιμοποιείται για την εξόρυξη και ανάλυση δεδομένων και για να επιτευχθεί αυτή η λειτουργία γίνεται χρήση του Streamlit. Η εφαρμογή υποστηρίζει διάφορες λειτουργίες όπως η φόρτωση δεδομένων, οι προδιαγραφές πινάκων, οι 2D οπτικοποιήσεις βασισμένες σε διαφορετικούς αλγορίθμους, η μηχανική μάθηση όπου δίνονται δύο επιλογές ειδών αλγορίθμων για τον χρήστη (κατηγοριοποίησης ή ομαδοποίησης) όπου μπορεί να πραγματοποιηθεί και σύγκριση των προαναφερόμενων αλγορίθμων με σκοπό την εύρεση του πιο αποδοτικού και τέλος μια παρουσίαση του τρόπου λειτουργίας της εφαρμογής (το παρόν κομμάτι).")
    st.markdown("## How to Use it?")
    st.write("Η χρήση της εφαρμογής είναι απλοϊκή και εύκολα κατανοητή για όλους. Αρχικά ο χρήστης μπορεί να ανεβάσει τα δεδομένα που θέλει σε μορφή CSV, Excel. Έπειτα από αυτό ο χρήστης μπορεί να αποφασίσει ποια λειτουργία της εφαρμογής θέλει να εκμεταλευτεί. Στα αριστερά του ανοιχτού παραθύρου βρίσκονται οι ακόλουθες επιλογές:  DataFrame_tab, Visualization_tab, Machine_Learning_tab, Info_tab με κάθε μια από αυτές να εκτελεί μια διαφορετική λειτουργία.")
    st.markdown("### Data Frame:")
